content/zettels/the_intelligent_investor.md
+++
title = "The Intelligent Investor"
author = ["Jethro Kuan"]
lastmod = 2020-03-16T19:48:17+08:00
slug = "the_intelligent_investor"
draft = false
+++

author
: [Benjamin Graham]({{< relref "benjamin_graham" >}})

tags
: [Finance]({{< relref "finance" >}})

## Investor vs Speculator {#investor-vs-speculator}

The investor must recognize the existence of a _speculative factor_ in their common-stock holdings, and keep this components within minor limits.

The defensive investor must confine himself to the shares of important companies with a long record of profitable operations and in strong financial condition.

1.  Always thoroughly analyse a company, and the soundness of the underlying businesses, before buying its stock.
2.  Deliberate protect yourself against serious losses
3.  aspire to "adequate", not extraordinary performance
